[
  {
    "isbn": "9781760983215",
    "dateFinished": "2020-09-06",
    "title": "Luster",
    "authors": [
      "Raven Leilani"
    ],
    "publishedDate": "2020-08-04",
    "description": "Sharp, comic, disruptive, tender, Raven Leilani's debut novel, Luster, sees a young black woman fall into art and someone else's open marriage. Edie is stumbling her way through her twenties--sharing a subpar apartment in Bushwick, clocking in and out of her admin job, making a series of inappropriate sexual choices. She's also, secretly, haltingly, figuring her way into life as an artist. And then she meets Eric, a digital archivist with a family in New Jersey, including an autopsist wife who has agreed to an open marriage--with rules. As if navigating the constantly shifting landscapes of contemporary sexual manners and racial politics weren't hard enough, Edie finds herself unemployed and falling into Eric's family life, his home. She becomes a hesitant friend to his wife and a de facto role model to his adopted daughter. Edie is the only black woman who young Akila knows. Razor sharp, darkly comic, sexually charged, socially disruptive, Luster is a portrait of a young woman trying to make her sense of her life in a tumultuous era. It is also a haunting, aching description of how hard it is to believe in your own talent and the unexpected influences that bring us into ourselves along the way.",
    "pageCount": 240,
    "format": "BOOK",
    "thumbnail": "https://books.google.com/books/content?id=eJ06zQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "link": "https://books.google.com/books/about/Luster.html?hl=&id=eJ06zQEACAAJ"
  },
  {
    "isbn": "9780374719760",
    "dateFinished": "2020-11-22",
    "title": "Uncanny Valley",
    "authors": [
      "Anna Wiener"
    ],
    "publishedDate": "2020-01-14",
    "description": "One of Vogue''s 22 Books to Read This Winter \"A definitive document of a world in transition: I won''t be alone in returning to Uncanny Valley for clarity and consolation for many years to come.\" —Jia Tolentino, author of Trick Mirror: Reflections on Self-Delusion The prescient, page-turning account of a journey in Silicon Valley: a defining memoir of our digital age In her mid-twenties, at the height of tech industry idealism, Anna Wiener—stuck, broke, and looking for meaning in her work, like any good millennial--left a job in book publishing for the promise of the new digital economy. She moved from New York to San Francisco, where she landed at a big-data startup in the heart of the Silicon Valley bubble: a world of surreal extravagance, dubious success, and fresh-faced entrepreneurs hell-bent on domination, glory, and, of course, progress. Anna arrived amidst a massive cultural shift, as the tech industry rapidly transformed into a locus of wealth and power rivaling Wall Street. But amid the company ski vacations and in-office speakeasies, boyish camaraderie and ride-or-die corporate fealty, a new Silicon Valley began to emerge: one in far over its head, one that enriched itself at the expense of the idyllic future it claimed to be building. Part coming-age-story, part portrait of an already-bygone era, Anna Wiener’s memoir is a rare first-person glimpse into high-flying, reckless startup culture at a time of unchecked ambition, unregulated surveillance, wild fortune, and accelerating political power. With wit, candor, and heart, Anna deftly charts the tech industry’s shift from self-appointed world savior to democracy-endangering liability, alongside a personal narrative of aspiration, ambivalence, and disillusionment. Unsparing and incisive, Uncanny Valley is a cautionary tale, and a revelatory interrogation of a world reckoning with consequences its unwitting designers are only beginning to understand.",
    "pageCount": 288,
    "format": "BOOK",
    "categories": [
      "Biography & Autobiography"
    ],
    "thumbnail": "https://books.google.com/books/content?id=5fqTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "link": "https://play.google.com/store/books/details?id=5fqTDwAAQBAJ"
  },
  {
    "isbn": "9780399181146",
    "dateFinished": "2021-01-10",
    "title": "Black Futures",
    "authors": [
      "Kimberly Drew",
      "Jenna Wortham"
    ],
    "publishedDate": "2020-12-01",
    "description": "NEW YORK TIMES EDITORS’ CHOICE • An archive of collective memory and exuberant testimony A luminous map to navigate an opaque and disorienting present An infinite geography of possible futures What does it mean to be Black and alive right now? Kimberly Drew and Jenna Wortham have brought together this collection of work—images, photos, essays, memes, dialogues, recipes, tweets, poetry, and more—to tell the story of the radical, imaginative, provocative, and gorgeous world that Black creators are bringing forth today. The book presents a succession of startling and beautiful pieces that generate an entrancing rhythm: Readers will go from conversations with activists and academics to memes and Instagram posts, from powerful essays to dazzling paintings and insightful infographics. In answering the question of what it means to be Black and alive, Black Futures opens a prismatic vision of possibility for every reader.",
    "pageCount": 544,
    "format": "BOOK",
    "categories": [
      "Social Science"
    ],
    "thumbnail": "https://books.google.com/books/content?id=pUGGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "link": "https://play.google.com/store/books/details?id=pUGGDwAAQBAJ"
  },
  {
    "isbn": "9780525620792",
    "dateFinished": "2021-09-26",
    "title": "Mexican Gothic",
    "authors": [
      "Silvia Moreno-Garcia"
    ],
    "publishedDate": "2020-06-30",
    "description": "NEW YORK TIMES BESTSELLER • “It’s Lovecraft meets the Brontës in Latin America, and after a slow-burn start Mexican Gothic gets seriously weird.”—The Guardian IN DEVELOPMENT AS A HULU ORIGINAL LIMITED SERIES PRODUCED BY KELLY RIPA AND MARK CONSUELOS • FINALIST FOR THE LOCUS AWARD • NOMINATED FOR THE BRAM STOKER AWARD • NAMED ONE OF THE BEST BOOKS OF THE YEAR BY The New Yorker • Vanity Fair • NPR • The Washington Post • Tordotcom • Marie Claire • Vox • Mashable • Men’s Health • Library Journal • Book Riot • LibraryReads An isolated mansion. A chillingly charismatic aristocrat. And a brave socialite drawn to expose their treacherous secrets. . . . From the author of Gods of Jade and Shadow comes “a terrifying twist on classic gothic horror” (Kirkus Reviews) set in glamorous 1950s Mexico. After receiving a frantic letter from her newly-wed cousin begging for someone to save her from a mysterious doom, Noemí Taboada heads to High Place, a distant house in the Mexican countryside. She’s not sure what she will find—her cousin’s husband, a handsome Englishman, is a stranger, and Noemí knows little about the region. Noemí is also an unlikely rescuer: She’s a glamorous debutante, and her chic gowns and perfect red lipstick are more suited for cocktail parties than amateur sleuthing. But she’s also tough and smart, with an indomitable will, and she is not afraid: Not of her cousin’s new husband, who is both menacing and alluring; not of his father, the ancient patriarch who seems to be fascinated by Noemí; and not even of the house itself, which begins to invade Noemi’s dreams with visions of blood and doom. Her only ally in this inhospitable abode is the family’s youngest son. Shy and gentle, he seems to want to help Noemí, but might also be hiding dark knowledge of his family’s past. For there are many secrets behind the walls of High Place. The family’s once colossal wealth and faded mining empire kept them from prying eyes, but as Noemí digs deeper she unearths stories of violence and madness. And Noemí, mesmerized by the terrifying yet seductive world of High Place, may soon find it impossible to ever leave this enigmatic house behind. “It’s as if a supernatural power compels us to turn the pages of the gripping Mexican Gothic.”—The Washington Post “Mexican Gothic is the perfect summer horror read, and marks Moreno-Garcia with her hypnotic and engaging prose as one of the genre’s most exciting talents.”—Nerdist “A period thriller as rich in suspense as it is in lush ’50s atmosphere.”—Entertainment Weekly",
    "pageCount": 320,
    "format": "BOOK",
    "categories": [
      "Fiction"
    ],
    "thumbnail": "https://books.google.com/books/content?id=ksKyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "link": "https://play.google.com/store/books/details?id=ksKyDwAAQBAJ"
  },
  {
    "isbn": "9781317588610",
    "dateFinished": "2022-01-13",
    "title": "Ain't I a Woman",
    "authors": [
      "bell hooks"
    ],
    "publishedDate": "2014-12-17",
    "description": "A classic work of feminist scholarship, Ain't I a Woman has become a must-read for all those interested in the nature of black womanhood. Examining the impact of sexism on black women during slavery, the devaluation of black womanhood, black male sexism, racism among feminists, and the black woman's involvement with feminism, hooks attempts to move us beyond racist and sexist assumptions. The result is nothing short of groundbreaking, giving this book a critical place on every feminist scholar's bookshelf.",
    "pageCount": 206,
    "format": "BOOK",
    "categories": [
      "Social Science"
    ],
    "thumbnail": "https://books.google.com/books/content?id=f2_fBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "link": "https://play.google.com/store/books/details?id=f2_fBQAAQBAJ"
  },
  {
    "isbn": "9780525511342",
    "dateFinished": "2022-09-07",
    "title": "Woman of Light",
    "authors": [
      "Kali Fajardo-Anstine"
    ],
    "publishedDate": "2022-06-07",
    "description": "NATIONAL BESTSELLER • A dazzling epic of betrayal, love, and fate that spans five generations of an Indigenous Chicano family in the American West, from the author of the National Book Award finalist Sabrina & Corina A Phenomenal Book Club Pick • “Sometimes you just step into a book and let it wash over you, like you’re swimming under a big, sparkling night sky.”—Celeste Ng, author of Little Fires Everywhere and Everything I Never Told You ONE OF THE MOST ANTICIPATED BOOKS OF 2022—The Millions, Electric Lit, Lit Hub, Book Riot There is one every generation, a seer who keeps the stories. Luz “Little Light” Lopez, a tea leaf reader and laundress, is left to fend for herself after her older brother, Diego, a snake charmer and factory worker, is run out of town by a violent white mob. As Luz navigates 1930s Denver, she begins to have visions that transport her to her Indigenous homeland in the nearby Lost Territory. Luz recollects her ancestors’ origins, how her family flourished, and how they were threatened. She bears witness to the sinister forces that have devastated her people and their homelands for generations. In the end, it is up to Luz to save her family stories from disappearing into oblivion. Written in Kali Fajardo-Anstine’s singular voice, the wildly entertaining and complex lives of the Lopez family fill the pages of this multigenerational western saga. Woman of Light is a transfixing novel about survival, family secrets, and love—filled with an unforgettable cast of characters, all of whom are just as special, memorable, and complicated as our beloved heroine, Luz.",
    "pageCount": 336,
    "format": "BOOK",
    "categories": [
      "Fiction"
    ],
    "thumbnail": "https://books.google.com/books/content?id=5LhBEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "link": "https://play.google.com/store/books/details?id=5LhBEAAAQBAJ"
  },
  {
    "isbn": "9781953534064",
    "dateStarted": "2022-09-10",
    "title": "Lesser Known Monsters of the 21st Century",
    "authors": [
      "Kim Fu"
    ],
    "publishedDate": "2022-02-01",
    "description": "\"The strange and wonderful define Kim Fu’s story collection, where the line between fantasy and reality fades in and out, elusive and beckoning.\" —The New York Times Book Review A LitHub, ALTA, and PureWow Best Book of the Month A BuzzFeed and WIRED Pick for a Book You Need to Read This Winter In the twelve unforgettable tales of Lesser Known Monsters of the 21st Century, the strange is made familiar and the familiar strange, such that a girl growing wings on her legs feels like an ordinary rite of passage, while a bug-infested house becomes an impossible, Kafkaesque nightmare. Each story builds a new world all its own: a group of children steal a haunted doll; a runaway bride encounters a sea monster; a vendor sells toy boxes that seemingly control the passage of time; an insomniac is seduced by the Sandman. These visions of modern life wrestle with themes of death and technological consequence, guilt and sexuality, and unmask the contradictions that exist within all of us. Mesmerizing, electric, and wholly original, Kim Fu’s Lesser Known Monsters of the 21st Century blurs the boundaries of the real and fantastic, offering intricate and surprising insights into human nature.",
    "pageCount": 232,
    "format": "BOOK",
    "categories": [
      "Fiction"
    ],
    "thumbnail": "https://books.google.com/books/content?id=4D1UEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "link": "https://play.google.com/store/books/details?id=4D1UEAAAQBAJ",
    "dateFinished": "2022-09-11",
    "notes": ""
  },
  {
    "isbn": "9780446696166",
    "dateAdded": "2022-10-02",
    "status": "want to read",
    "title": "Fledgling",
    "authors": [
      "Octavia E. Butler"
    ],
    "publishedDate": "2007-01-02",
    "description": "\"A master storyteller, Butler casts an unflinching eye on racism, sexism, poverty, and ignorance and lets the reader see the terror and beauty of human nature.\" - The Washington Post This is the story of an apparently young, amnesiac girl whose alarmingly unhuman needs and abilities lead her to a startling conclusion: She is in fact a genetically modified, 53-year-old vampire. Forced to discover what she can about her stolen former life, she must at the same time learn who wanted-and still wants-to destroy her and those she cares for and how she can save herself.",
    "pageCount": 320,
    "format": "BOOK",
    "categories": [
      "Fiction"
    ],
    "thumbnail": "https://books.google.com/books/content?id=LIH6wAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "link": "https://books.google.com/books/about/Fledgling.html?hl=&id=LIH6wAEACAAJ"
  },
  {
    "isbn": "9780374717124",
    "dateStarted": "2022-11-24",
    "dateFinished": "2022-11-25",
    "status": "finished",
    "rating": "⭐️⭐️⭐️⭐️",
    "tags": [
      "recommend"
    ],
    "title": "Bliss Montage",
    "authors": [
      "Ling Ma"
    ],
    "publishedDate": "2022-09-13",
    "description": "A new creation by the author of Severance, Bliss Montage crashes through our carefully built mirages. What happens when fantasy tears the screen of the everyday to wake us up? Could that waking be our end? In Bliss Montage, Ling Ma brings us eight wildly different tales of people making their way through the madness and reality of our collective delusions: love and loneliness, connection and possession, friendship, motherhood, the idea of home. A woman lives in a house with all her ex-boyfriends. A toxic friendship grows up around a drug that makes you invisible. An ancient ritual might heal you of anything—if you bury yourself alive. These and other scenarios investigate the ways that the outlandish and the ordinary are shockingly, deceptively, heartbreakingly alike.",
    "pageCount": 145,
    "format": "BOOK",
    "categories": [
      "Fiction"
    ],
    "thumbnail": "https://books.google.com/books/content?id=8ABdEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "link": "https://play.google.com/store/books/details?id=8ABdEAAAQBAJ"
  },
  {
    "isbn": "9781623175979",
    "dateStarted": "2022-11-30",
    "dateFinished": "2022-11-30",
    "status": "finished",
    "rating": "⭐️⭐️⭐️⭐️⭐️",
    "tags": [
      "recommend"
    ],
    "title": "Belly of the Beast",
    "authors": [
      "Da'Shaun L. Harrison"
    ],
    "publishedDate": "2021-08-10",
    "description": "**The 2022 Lammy Award Winner in Transgender Nonfiction** Exploring the intersections of Blackness, gender, fatness, health, and the violence of policing. To live in a body both fat and Black is to exist at the margins of a society that creates the conditions for anti-fatness as anti-Blackness. Hyper-policed by state and society, passed over for housing and jobs, and derided and misdiagnosed by medical professionals, fat Black people in the United States are subject to sociopolitically sanctioned discrimination, abuse, condescension, and trauma. Da’Shaun Harrison--a fat, Black, disabled, and nonbinary trans writer--offers an incisive, fresh, and precise exploration of anti-fatness as anti-Blackness, foregrounding the state-sanctioned murders of fat Black men and trans and nonbinary masculine people in historical analysis. Policing, disenfranchisement, and invisibilizing of fat Black men and trans and nonbinary masculine people are pervasive, insidious ways that anti-fat anti-Blackness shows up in everyday life. Fat people can be legally fired in 49 states for being fat; they’re more likely to be houseless. Fat people die at higher rates from misdiagnosis or nontreatment; fat women are more likely to be sexually assaulted. And at the intersections of fatness, Blackness, disability, and gender, these abuses are exacerbated. Taking on desirability politics, the limitations of gender, the connection between anti-fatness and carcerality, and the incongruity of “health” and “healthiness” for the Black fat, Harrison viscerally and vividly illustrates the myriad harms of anti-fat anti-Blackness. They offer strategies for dismantling denial, unlearning the cultural programming that tells us “fat is bad,” and destroying the world as we know it, so the Black fat can inhabit a place not built on their subjugation.",
    "pageCount": 148,
    "format": "BOOK",
    "categories": [
      "Social Science"
    ],
    "thumbnail": "https://books.google.com/books/content?id=nvQ3EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "link": "https://books.google.com/books/about/Belly_of_the_Beast.html?hl=&id=nvQ3EAAAQBAJ"
  },
  {
    "isbn": "9781984820648",
    "dateAdded": "2022-11-25",
    "status": "finished",
    "rating": "⭐️⭐️⭐️",
    "title": "The Paradox Hotel",
    "authors": [
      "Rob Hart"
    ],
    "publishedDate": "2022-02-22",
    "description": "“Time travel, murder, corruption, restless baby dinosaurs, and a snarky robot named Ruby collide in this excellent, noir-inflected, humor-infused, science-fiction thriller.”—The Boston Globe An impossible crime. A detective on the edge of madness. The future of time travel at stake. From the author of The Warehouse . . . ONE OF THE BEST BOOKS OF THE YEAR: NPR January Cole’s job just got a whole lot harder. Not that running security at the Paradox was ever really easy. Nothing’s simple at a hotel where the ultra-wealthy tourists arrive costumed for a dozen different time periods, all eagerly waiting to catch their “flights” to the past. Or where proximity to the timeport makes the clocks run backward on occasion—and, rumor has it, allows ghosts to stroll the halls. None of that compares to the corpse in room 526. The one that seems to be both there and not there. The one that somehow only January can see. On top of that, some very important new guests have just checked in. Because the U.S. government is about to privatize time-travel technology—and the world’s most powerful people are on hand to stake their claims. January is sure the timing isn’t a coincidence. Neither are those “accidents” that start stalking their bidders. There’s a reason January can glimpse what others can’t. A reason why she’s the only one who can catch a killer who’s operating invisibly and in plain sight, all at once. But her ability is also destroying her grip on reality—and as her past, present, and future collide, she finds herself confronting not just the hotel’s dark secrets but her own. At once a dazzlingly time-twisting murder mystery and a story about grief, memory, and what it means to—literally—come face-to-face with our ghosts, The Paradox Hotel is another unforgettable speculative thrill ride from acclaimed author Rob Hart.",
    "pageCount": 337,
    "format": "BOOK",
    "categories": [
      "Fiction"
    ],
    "thumbnail": "https://books.google.com/books/content?id=8bNaEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "link": "https://books.google.com/books/about/The_Paradox_Hotel.html?hl=&id=8bNaEAAAQBAJ",
    "dateStarted": "2022-11-30",
    "dateFinished": "2022-12-03"
  },
  {
    "isbn": "9781476716763",
    "dateStarted": "2022-12-03",
    "dateFinished": "2022-12-06",
    "status": "finished",
    "rating": "⭐️⭐️⭐️⭐️",
    "tags": [
      "recommend"
    ],
    "title": "The Candy House",
    "authors": [
      "Jennifer Egan"
    ],
    "publishedDate": "2022-04-05",
    "description": "Named a Most Anticipated Book of the Year by Time, Entertainment Weekly, Vogue, Good Housekeeping, Oprah Daily, Glamour, USA TODAY, Parade, Bustle, San Francisco Chronicle, The Seattle Times, The Boston Globe, Tampa Bay Times, BuzzFeed, Vulture, and many more! From one of the most celebrated writers of our time, a literary figure with cult status, a \"sibling novel\" to her Pulitzer Prize- and ?NBCC Award-winning A Visit from the Goon Squad--an electrifying, deeply moving novel about the quest for authenticity and meaning in a world where memories and identities are no longer private. The Candy House opens with the staggeringly brilliant Bix Bouton, whose company, Mandala, is so successful that he is \"one of those tech demi-gods with whom we're all on a first name basis.\" Bix is 40, with four kids, restless, desperate for a new idea, when he stumbles into a conversation group, mostly Columbia professors, one of whom is experimenting with downloading or \"externalizing\" memory. It's 2010. Within a decade, Bix's new technology, \"Own Your Unconscious\"--that allows you access to every memory you've ever had, and to share every memory in exchange for access to the memories of others--has seduced multitudes. But not everyone. In spellbinding interlocking narratives, Egan spins out the consequences of Own Your Unconscious through the lives of multiple characters whose paths intersect over several decades. Intellectually dazzling, The Candy House is also extraordinarily moving, a testament to the tenacity and transcendence of human longing for real connection, love, family, privacy and redemption. In the world of Egan's spectacular imagination, there are \"counters\" who track and exploit desires and there are \"eluders,\" those who understand the price of taking a bite of the Candy House. Egan introduces these characters in an astonishing array of narrative styles--from omniscient to first person plural to a duet of voices, an epistolary chapter and a chapter of tweets. If Goon Squad was organized like a concept album, The Candy House incorporates Electronic Dance Music's more disjunctive approach. The parts are titled: Build, Break, Drop. With an emphasis on gaming, portals, and alternate worlds, its structure also suggests the experience of moving among dimensions in a role-playing game. The Candy House is a bold, brilliant imagining of a world that is moments away. Egan takes to stunning new heights her \"deeply intuitive forays into the darker aspects of our technology-driven, image-saturated culture\" (Vogue). The Candy House delivers an absolutely extraordinary combination of fierce, exhilarating intelligence and heart.",
    "pageCount": 352,
    "format": "BOOK",
    "categories": [
      "Fiction"
    ],
    "thumbnail": "https://books.google.com/books/content?id=WB9oEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "link": "https://books.google.com/books/about/The_Candy_House.html?hl=&id=WB9oEAAAQBAJ"
  },
  {
    "isbn": "9780593356173",
    "dateAdded": "2023-01-24",
    "status": "want to read",
    "rating": "unrated",
    "title": "The Maid",
    "authors": [
      "Nita Prose"
    ],
    "publishedDate": "2023-01-03",
    "description": "#1 NEW YORK TIMES BESTSELLER • GOOD MORNING AMERICA BOOK CLUB PICK • “A heartwarming mystery with a lovable oddball at its center” (Real Simple), this cozy whodunit introduces a one-of-a-kind heroine who will steal your heart. “The reader comes to understand Molly’s worldview, and to sympathize with her longing to be accepted—a quest that gives The Maid real emotional heft.”—The New York Times Book Review (Editors’ Choice) “Think Clue. Think page-turner.”—Glamour In development as a major motion picture produced by and starring Florence Pugh Molly Gray is not like everyone else. She struggles with social skills and misreads the intentions of others. Her gran used to interpret the world for her, codifying it into simple rules that Molly could live by. Since Gran died a few months ago, twenty-five-year-old Molly has been navigating life’s complexities all by herself. No matter—she throws herself with gusto into her work as a hotel maid. Her unique character, along with her obsessive love of cleaning and proper etiquette, make her an ideal fit for the job. She delights in donning her crisp uniform each morning, stocking her cart with miniature soaps and bottles, and returning guest rooms at the Regency Grand Hotel to a state of perfection. But Molly’s orderly life is upended the day she enters the suite of the infamous and wealthy Charles Black, only to find it in a state of disarray and Mr. Black himself dead in his bed. Before she knows what’s happening, Molly’s unusual demeanor has the police targeting her as their lead suspect. She quickly finds herself caught in a web of deception, one she has no idea how to untangle. Fortunately for Molly, friends she never knew she had unite with her in a search for clues to what really happened to Mr. Black—but will they be able to find the real killer before it’s too late? A Clue-like, locked-room mystery and a heartwarming journey of the spirit, The Maid explores what it means to be the same as everyone else and yet entirely different—and reveals that all mysteries can be solved through connection to the human heart.",
    "format": "BOOK",
    "categories": [
      "Fiction"
    ],
    "thumbnail": "https://books.google.com/books/content?id=-zCUEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "link": "https://books.google.com/books/about/The_Maid.html?hl=&id=-zCUEAAAQBAJ",
    "pageCount": 320
  },
  {
    "isbn": "9780385547789",
    "dateAdded": "2023-05-06",
    "status": "want to read",
    "rating": "unrated",
    "title": "Stay True",
    "authors": [
      "Hua Hsu"
    ],
    "publishedDate": "2022-09-27",
    "description": "NATIONAL BOOK CRITICS CIRCLE AWARD WINNER • A gripping memoir on friendship, grief, the search for self, and the solace that can be found through art, by the New Yorker staff writer Hua Hsu “This book is exquisite and excruciating and I will be thinking about it for years and years to come.” —Rachel Kushner, New York Times bestselling author of The Flamethrowers and The Mars Room In the eyes of eighteen-year-old Hua Hsu, the problem with Ken—with his passion for Dave Matthews, Abercrombie & Fitch, and his fraternity—is that he is exactly like everyone else. Ken, whose Japanese American family has been in the United States for generations, is mainstream; for Hua, the son of Taiwanese immigrants, who makes ’zines and haunts Bay Area record shops, Ken represents all that he defines himself in opposition to. The only thing Hua and Ken have in common is that, however they engage with it, American culture doesn’t seem to have a place for either of them. But despite his first impressions, Hua and Ken become friends, a friendship built on late-night conversations over cigarettes, long drives along the California coast, and the successes and humiliations of everyday college life. And then violently, senselessly, Ken is gone, killed in a carjacking, not even three years after the day they first meet. Determined to hold on to all that was left of one of his closest friends—his memories—Hua turned to writing. Stay True is the book he’s been working on ever since. A coming-of-age story that details both the ordinary and extraordinary, Stay True is a bracing memoir about growing up, and about moving through the world in search of meaning and belonging.",
    "pageCount": 193,
    "format": "BOOK",
    "categories": [
      "Biography & Autobiography"
    ],
    "thumbnail": "https://books.google.com/books/content?id=cVBTEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api&w=1280",
    "language": "en",
    "link": "https://play.google.com/store/books/details?id=cVBTEAAAQBAJ"
  },
  {
    "isbn": "9780593241837",
    "dateAdded": "2023-12-04",
    "status": "want to read",
    "rating": "unrated",
    "title": "Unmasking AI",
    "authors": [
      "Joy Buolamwini"
    ],
    "publishedDate": "2023-10-31",
    "description": "“The conscience of the AI revolution” (Fortune) explains how we’ve arrived at an era of AI harms and oppression, and what we can do to avoid its pitfalls. “Dr. Joy Buolamwini has been an essential figure in bringing irresponsible, profit-hungry tech giants to their knees. If you’re going to read only one book about AI, this should be it.”—Darren Walker, president of the Ford Foundation To most of us, it seems like recent developments in artificial intelligence emerged out of nowhere to pose unprecedented threats to humankind. But to Dr. Joy Buolamwini, who has been at the forefront of AI research, this moment has been a long time in the making. After tinkering with robotics as a high school student in Memphis and then developing mobile apps in Zambia as a Fulbright fellow, Buolamwini followed her lifelong passion for computer science, engineering, and art to MIT in 2015. As a graduate student at the “Future Factory,” she did groundbreaking research that exposed widespread racial and gender bias in AI services from tech giants across the world. Unmasking AI goes beyond the headlines about existential risks produced by Big Tech. It is the remarkable story of how Buolamwini uncovered what she calls “the coded gaze”—the evidence of encoded discrimination and exclusion in tech products—and how she galvanized the movement to prevent AI harms by founding the Algorithmic Justice League. Applying an intersectional lens to both the tech industry and the research sector, she shows how racism, sexism, colorism, and ableism can overlap and render broad swaths of humanity “excoded” and therefore vulnerable in a world rapidly adopting AI tools. Computers, she reminds us, are reflections of both the aspirations and the limitations of the people who create them. Encouraging experts and non-experts alike to join this fight, Buolamwini writes, “The rising frontier for civil rights will require algorithmic justice. AI should be for the people and by the people, not just the privileged few.”",
    "pageCount": 337,
    "format": "BOOK",
    "categories": [
      "Biography & Autobiography"
    ],
    "thumbnail": "https://books.google.com/books/content?id=rT7REAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "link": "https://books.google.com/books/about/Unmasking_AI.html?hl=&id=rT7REAAAQBAJ"
  },
  {
    "isbn": "9781619634459",
    "dateStarted": "2023-12-15",
    "status": "started",
    "rating": "unrated",
    "title": "A Court of Thorns and Roses",
    "authors": [
      "Sarah J. Maas"
    ],
    "publishedDate": "2015-05-05",
    "description": "The sexy, action-packed first book in the #1 New York Times bestselling Court of Thorns and Roses series from Sarah J. Maas. When nineteen-year-old huntress Feyre kills a wolf in the woods, a terrifying creature arrives to demand retribution. Dragged to a treacherous magical land she knows about only from legends, Feyre discovers that her captor is not truly a beast, but one of the lethal, immortal faeries who once ruled her world. At least, he's not a beast all the time. As she adapts to her new home, her feelings for the faerie, Tamlin, transform from icy hostility into a fiery passion that burns through every lie she's been told about the beautiful, dangerous world of the Fae. But something is not right in the faerie lands. An ancient, wicked shadow is growing, and Feyre must find a way to stop it, or doom Tamlin-and his world-forever. From bestselling author Sarah J. Maas comes a seductive, breathtaking book that blends romance, adventure, and faerie lore into an unforgettable read.",
    "pageCount": 451,
    "format": "BOOK",
    "categories": [
      "Fiction"
    ],
    "thumbnail": "https://books.google.com/books/content?id=E-kdBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "link": "https://play.google.com/store/books/details?id=E-kdBQAAQBAJ"
  },
  {
    "isbn": "9781984825469",
    "dateAdded": "2023-12-06",
    "status": "finished",
    "rating": "unrated",
    "title": "The Shame Machine",
    "authors": [
      "Cathy O'Neil"
    ],
    "publishedDate": "2022-03-22",
    "description": "NEW YORK TIMES EDITORS’ CHOICE • A clear-eyed warning about the increasingly destructive influence of America’s “shame industrial complex” in the age of social media and hyperpartisan politics—from the New York Times bestselling author of Weapons of Math Destruction “O’Neil reminds us that we must resist the urge to judge, belittle, and oversimplify, and instead allow always for complexity and lead always with empathy.”—Dave Eggers, author of The Every Shame is a powerful and sometimes useful tool: When we publicly shame corrupt politicians, abusive celebrities, or predatory corporations, we reinforce values of fairness and justice. But as Cathy O’Neil argues in this revelatory book, shaming has taken a new and dangerous turn. It is increasingly being weaponized—used as a way to shift responsibility for social problems from institutions to individuals. Shaming children for not being able to afford school lunches or adults for not being able to find work lets us off the hook as a society. After all, why pay higher taxes to fund programs for people who are fundamentally unworthy? O’Neil explores the machinery behind all this shame, showing how governments, corporations, and the healthcare system capitalize on it. There are damning stories of rehab clinics, reentry programs, drug and diet companies, and social media platforms—all of which profit from “punching down” on the vulnerable. Woven throughout The Shame Machine is the story of O’Neil’s own struggle with body image and her recent weight-loss surgery, which awakened her to the systematic shaming of fat people seeking medical care. With clarity and nuance, O’Neil dissects the relationship between shame and power. Whom does the system serve? Is it counter-productive to call out racists, misogynists, and vaccine skeptics? If so, when should someone be “canceled”? How do current incentive structures perpetuate the shaming cycle? And, most important, how can we all fight back?",
    "pageCount": 272,
    "format": "BOOK",
    "categories": [
      "Social Science"
    ],
    "thumbnail": "https://books.google.com/books/content?id=vWQ0EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "link": "https://play.google.com/store/books/details?id=vWQ0EAAAQBAJ",
    "dateStarted": "2023-12-25",
    "dateAbandoned": "2023-12-25",
    "dateFinished": "2023-12-20"
  },
  {
    "identifier": {
      "libby": "9575390"
    },
    "dateAdded": "2024-05-23",
    "status": "started",
    "rating": "unrated",
    "title": "Clytemnestra",
    "description": "Monarch. Mother. Murderer. Magnificent. You were born to a king, but you marry a tyrant. You stand by helplessly as he sacrifices your child to placate the gods. You watch him wage war on a foreign shore, and you comfort yourself with violent thoughts of your own. Because this was not the first offense against you. This was not the life you ever deserved. And this will not be your undoing. Slowly, you plot. When y...",
    "authors": [
      "Costanza Casati",
      "Olivia Vinall"
    ],
    "link": "https://share.libbyapp.com/title/9575390",
    "thumbnail": "https://img1.od-cdn.com/ImageType-100/1694-1/{28ED6EE0-D071-4C51-9059-7BBE9EAA33DC}IMG100.JPG",
    "publishedDate": "2023-05-02",
    "publisher": "Recorded Books, Inc.",
    "categories": [
      "Fiction",
      "Literature",
      "Mythology",
      "Historical Fiction"
    ],
    "format": "audiobook",
    "dateStarted": "2024-05-23"
  },
  {
    "identifier": "9510886",
    "identifiers": {
      "libby": "9510886"
    },
    "dateStarted": "2024-01-01",
    "status": "finished",
    "rating": "⭐️⭐️⭐️⭐️⭐️",
    "image": "book-9510886.png",
    "link": "https://share.libbyapp.com/title/9510886",
    "title": "The Worlds I See",
    "description": "The moving memoir of a scientist coming of age as an immigrant in America who finds her calling at the forefront of the AI revolution.Wired called Dr. Fei-Fei Li “one of a tiny group of scientists - a group perhaps small enough to fit around a kitchen table - who are responsible for AI’s recent remarkable advances.”Known to the world as the creator of ImageNet, a key catalyst of modern artificial intelligence, Dr....",
    "authors": [
      "Fei-Fei Li",
      "Cindy Kay"
    ],
    "publishedDate": "2023-11-07",
    "thumbnail": "https://img2.od-cdn.com/ImageType-100/1493-1/{07ADF52D-D0E9-4044-867E-3E66A217A7F0}IMG100.JPG",
    "publisher": "Macmillan Audio",
    "categories": [
      "Biography & Autobiography",
      "Sociology",
      "Technology",
      "Nonfiction"
    ],
    "format": "audiobook",
    "dateFinished": "2024-01-05"
  },
  {
    "identifier": "9781797176888",
    "identifiers": {
      "librofm": "9781797176888",
      "isbn": "9781797176888"
    },
    "dateStarted": "2024-05-25",
    "status": "finished",
    "rating": "unrated",
    "image": "book-9781797176888.png",
    "link": "https://libro.fm/audiobooks/9781797176888",
    "format": "audiobook",
    "title": "The Ministry of Time",
    "description": "“This summer’s hottest debut.” —Cosmopolitan • “Witty, sexy escapist fiction [that] packs a substantial punch...It’s a smart, gripping work that’s also a feast for the senses...Fresh and thrilling.” —Los Angeles Times • “Electric...I loved every second.” —Emily Henry “Utterly winning...Imagine if The Time Traveler’s Wife had an affair with A Gentleman in Moscow...Readers, I envy you: There’s a smart, witty novel in your future.” —Ron Charles, The Washington Post A time travel romance, a spy thriller, a workplace comedy, and an ingenious exploration of the nature of power and the potential for love to change it all: Welcome to The Ministry of Time, the exhilarating debut novel by Kaliane Bradley.In the near future, a civil servant is offered the salary of her dreams and is, shortly afterward, told what project she’ll be working on. A recently established government ministry is gathering “expats” from across history to establish whether time travel is feasible—for the body, but also for the fabric of space-time. She is tasked with working as a “bridge”: living with, assisting, and monitoring the expat known as “1847” or Commander Graham Gore. As far as history is concerned, Commander Gore died on Sir John Franklin’s doomed 1845 expedition to the Arctic, so he’s a little disoriented to be living with an unmarried woman who regularly shows her calves, surrounded by outlandish concepts such as “washing machines,” “Spotify,” and “the collapse of the British Empire.” But with an appetite for discovery, a seven-a-day cigarette habit, and the support of a charming and chaotic cast of fellow expats, he soon adjusts. Over the next year, what the bridge initially thought would be, at best, a horrifically uncomfortable roommate dynamic, evolves into something much deeper. By the time the true shape of the Ministry’s project comes to light, the bridge has fallen haphazardly, fervently in love, with consequences she never could have imagined. Forced to confront the choices that brought them together, the bridge must finally reckon with how—and whether she believes—what she does next can change the future. An exquisitely original and feverishly fun fusion of genres and ideas, The Ministry of Time asks: What does it mean to defy history, when history is living in your house? Kaliane Bradley’s answer is a blazing, unforgettable testament to what we owe each other in a changing world.",
    "thumbnail": "https://covers.libro.fm/9781797176888_1120.jpg",
    "authors": [
      "Kaliane Bradley"
    ],
    "publisher": "Simon & Schuster Audio",
    "publishedDate": "2024-05-07",
    "dateFinished": "2024-05-26"
  },
  {
    "identifier": "9781478975311",
    "identifiers": {
      "librofm": "9781478975311",
      "isbn": "9781478975311"
    },
    "dateAdded": "2024-05-25",
    "status": "want to read",
    "rating": "unrated",
    "link": "https://libro.fm/audiobooks/9781478975311-circe",
    "format": "audiobook",
    "title": "Circe",
    "description": "This #1 is a \"bold and subversive retelling of the goddess's story\" that brilliantly reimagines the life of Circe, formidable sorceress of The Odyssey (Alexandra Alter, TheNew York Times). In the house of Helios, god of the sun and mightiest of the Titans, a daughter is born. But Circe is a strange child -- not powerful, like her father, nor viciously alluring like her mother. Turning to the world of mortals for companionship, she discovers that she does possess power -- the power of witchcraft, which can transform rivals into monsters and menace the gods themselves. Threatened, Zeus banishes her to a deserted island, where she hones her occult craft, tames wild beasts and crosses paths with many of the most famous figures in all of mythology, including the Minotaur, Daedalus and his doomed son Icarus, the murderous Medea, and, of course, wily Odysseus. But there is danger, too, for a woman who stands alone, and Circe unwittingly draws the wrath of both men and gods, ultimately finding herself pitted against one of the most terrifying and vengeful of the Olympians. To protect what she loves most, Circe must summon all her strength and choose, once and for all, whether she belongs with the gods she is born from, or the mortals she has come to love. With unforgettably vivid characters, mesmerizing language, and page-turning suspense, Circe is a triumph of storytelling, an intoxicating epic of family rivalry, palace intrigue, love and loss, as well as a celebration of indomitable female strength in a man's world.#1 -- named one of the Best Books of the Year by NPR, the Washington Post, People, Time, Amazon, Entertainment Weekly, Bustle, Newsweek, the A.V. Club, Christian Science Monitor, Refinery 29, Buzzfeed, Paste, Audible, Kirkus, Publishers Weekly, Thrillist, NYPL, Self, Real Simple, Goodreads, Boston Globe, Electric Literature, BookPage, the Guardian, Book Riot, Seattle Times, and Business Insider.",
    "thumbnail": "https://covers.libro.fm/9781478975311_1120.jpg",
    "authors": [
      "Madeline Miller"
    ],
    "publisher": "Hachette Audio",
    "publishedDate": "2018-04-10"
  },
  {
    "identifier": "id1579442238",
    "identifiers": {
      "apple": "id1579442238"
    },
    "dateStarted": "2024-07-13",
    "status": "started",
    "rating": "unrated",
    "image": "book-id1579442238.png",
    "link": "https://books.apple.com/us/audiobook/portrait-of-a-thief-a-novel-unabridged/id1579442238",
    "title": "Portrait of a Thief: A Novel (Unabridged)",
    "description": "INSTANT NEW YORK TIMES BESTSELLER An Edgar Award Nominee for Best First Novel Longlisted for the Center for Fiction's First Novel Prize Named a New York Times Best Crime Novel of 2022 Named A Most Anticipated Book of 2022 by * Marie Claire * * Wa…",
    "authors": [
      "Grace D. Li"
    ],
    "publishedDate": "2022-04-05T00:00:00.000Z",
    "thumbnail": "https://is1-ssl.mzstatic.com/image/thumb/Music126/v4/7a/81/3f/7a813f37-15f6-988c-0545-52d974b65209/9780593510957.d.jpg/1200x630wp.png",
    "categories": [
      "Fiction"
    ],
    "format": "audiobook"
  },
  {
    "identifier": "9781888363432",
    "identifiers": {
      "isbn": "9781888363432"
    },
    "dateAdded": "2024-12-31",
    "status": "finished",
    "rating": "unrated",
    "title": "I who have never known men",
    "authors": [
      "Jacqueline Harpman"
    ],
    "publishedDate": "1997",
    "description": "A work of fantasy, I Who Have Never Known Men is the haunting and unforgettable account of a near future on a barren earth where women are kept in underground cages guarded by uniformed groups of men. It is narrated by the youngest of the women, the only one with no memory of what the world was like before the cages, who must teach herself, without books or sexual contact, the essential human emotions of longing, loving, learning, companionship, and dying.",
    "pageCount": 206,
    "format": "book",
    "categories": [
      "Fiction, fantasy, general",
      "New York Times reviewed"
    ],
    "thumbnail": "https://covers.openlibrary.org/b/id/936140-L.jpg",
    "language": "en",
    "link": "https://openlibrary.org/books/OL998749M",
    "dateFinished": "2024-12-31"
  },
  {
    "identifier": "9780593867792",
    "identifiers": {
      "librofm": "9780593867792",
      "isbn": "9780593867792"
    },
    "dateFinished": "2025-01-02",
    "summaryEndDate": "2025-01-02",
    "status": "finished",
    "rating": "unrated",
    "title": "The God of the Woods",
    "authors": [
      "Liz Moore"
    ],
    "publishedDate": "2024-07-02",
    "description": "Early morning, August 1975: a camp counselor discovers an empty bunk. Its occupant, Barbara Van Laar, has gone missing. Barbara isn’t just any thirteen-year-old: she’s the daughter of the family that owns the summer camp and employs most of the region’s residents. And this isn’t the first time a Van Laar child has disappeared. Barbara’s older brother similarly vanished fourteen years ago, never to be found. As a panicked search begins, a thrilling drama unfolds. Chasing down the layered secrets of the Van Laar family and the blue-collar community working in its shadow, Moore’s multi-threaded story invites readers into a rich and gripping dynasty of secrets and second chances. It is Liz Moore’s most ambitious and wide-reaching novel yet.",
    "format": "audiobook",
    "categories": [
      "Fiction",
      "Fiction - Literary"
    ],
    "thumbnail": "https://covers.libro.fm/9780593867792_1120.jpg",
    "language": "en",
    "link": "https://libro.fm/audiobooks/9780593867792",
    "duration": "PT14H34M15S"
  },
  {
    "identifier": "4681636",
    "identifiers": {
      "libby": "4681636"
    },
    "dateAdded": "2025-01-05",
    "status": "started",
    "rating": "unrated",
    "link": "https://share.libbyapp.com/title/4681636",
    "title": "Long Bright River",
    "description": "ONE OF BARACK OBAMA’S FAVORITE BOOKS OF THE YEAR, BY THE AUTHOR OF THE THE GOD OF THE WOODS   [Moore’s] careful balance of the hard-bitten with the heartfelt is what elevates Long Bright River from entertaining page-turner to a book that makes you want to call someone you love. - The New York Times Book ReviewThis is police proce...",
    "authors": [
      "Liz Moore"
    ],
    "publishedDate": "2020-01-07",
    "thumbnail": "https://img1.od-cdn.com/ImageType-100/1191-1/{CF95195D-2BB7-4471-93EB-B7084481069E}Img100.jpg",
    "publisher": "Books on Tape",
    "categories": [
      "Fiction",
      "Thriller"
    ],
    "format": "audiobook",
    "duration": "PT13H0M",
    "dateStarted": "2025-01-05"
  },
  {
    "identifier": "11150266",
    "identifiers": {
      "libby": "11150266"
    },
    "dateAdded": "2025-01-22",
    "status": "want to read",
    "rating": "unrated",
    "link": "https://share.libbyapp.com/title/11150266",
    "title": "The Undercurrent",
    "description": "A mystery of remarkable scope, bristling with intelligence, beauty, and humanity. It is, quite simply: stunning. - Gillian Flynn, author of Gone GirlA stunning, achingly beautiful and gripping mystery. Full of page-turning suspense, intrigue, and secrets...I loved it. - Chris Whitaker, author of All the Colors of the DarkDelve into a thrilling novel where dark secrets and hidden agendas intertwine, keeping you on ...",
    "authors": [
      "Sarah Sawyer"
    ],
    "publishedDate": "2024-10-08",
    "thumbnail": "https://img1.od-cdn.com/ImageType-100/7552-1/{5EBD696D-A8CD-44E0-B4E3-28F87E9FDE23}IMG100.JPG",
    "publisher": "Zibby Books",
    "categories": [
      "Fiction",
      "Literature",
      "Thriller"
    ],
    "format": "audiobook"
  },
  {
    "identifier": "9781501197291",
    "identifiers": {
      "isbn": "9781501197291"
    },
    "dateFinished": "2025-02-15",
    "summaryEndDate": "2025-02-15",
    "status": "finished",
    "rating": "unrated",
    "title": "The Courage to Be Disliked",
    "authors": [
      "Ichiro Kishimi",
      "Fumitake Koga"
    ],
    "publishedDate": "2018-05-08",
    "description": "An international bestseller and TikTok sensation with more than 10 million copies sold worldwide, The Courage to Be Disliked is a transformative and practical guide to personal happiness and self-fulfillment. Now you can unlock your full potential and free yourself from the shackles of past traumas and societal expectations to find true personal happiness. Based on the theories of renowned psychologist Alfred Adler, this book guides you through the principles of self-forgiveness, self-care, and mind decluttering in a straightforward, easy-to-digest style that’s accessible to all. The Courage to Be Disliked unfolds as a dialogue between a philosopher and a young man, who, over the course of five enriching conversations, realizes that each of us is in control of our life’s direction, independent of past burdens and expectations of others. Wise, empowering, and profoundly liberating, this book is a life-changing experience that shows you a path to lasting happiness and how to finally be the person you truly want to be. Millions are already benefiting from its teachings—and you can be next.",
    "pageCount": 288,
    "format": "book",
    "categories": [
      "Self-Help",
      "Self-Help / Personal Growth / Happiness",
      "Self-Help / Motivational & Inspirational",
      "Philosophy / Free Will & Determinism"
    ],
    "thumbnail": "https://books.google.com/books/publisher/content?id=hGFEDwAAQBAJ&printsec=frontcover&img=1&zoom=6&edge=curl&source=gbs_api",
    "language": "en",
    "link": "https://play.google.com/store/books/details?id=hGFEDwAAQBAJ"
  }
]